aws/amazon-freertos/projects/microchip/same70_xult/mplab/aws_demos/firmware/src/packs/ATSAME70Q21B_DFP/atsame70q21b.h
/** \addtogroup SAME70Q21B_pio Peripheral Pio Definitions
 *  @{
 */

/* ************************************************************************** */
/*   PIO DEFINITIONS FOR SAME70Q21B                                           */
/* ************************************************************************** */
#include "pio/same70q21b.h"
/** @}  end of Peripheral Pio Definitions */

/* ************************************************************************** */
/*   MEMORY MAPPING DEFINITIONS FOR SAME70Q21B                                */
/* ************************************************************************** */

#define PERIPHERALS_SIZE               _UL_(0x20000000)    /* 524288kB Memory segment type: io */
#define SYSTEM_SIZE                    _UL_(0x10000000)    /* 262144kB Memory segment type: io */
#define QSPIMEM_SIZE                   _UL_(0x20000000)    /* 524288kB Memory segment type: other */
#define AXIMX_SIZE                     _UL_(0x00100000)    /* 1024kB Memory segment type: other */
#define ITCM_SIZE                      _UL_(0x00200000)    /* 2048kB Memory segment type: other */
#define IFLASH_SIZE                    _UL_(0x00200000)    /* 2048kB Memory segment type: flash */
#define IFLASH_PAGE_SIZE               _UL_(       512)
#define IFLASH_NB_OF_PAGES             _UL_(      4096)

#define IROM_SIZE                      _UL_(0x00004000)    /*   16kB Memory segment type: rom */
#define DTCM_SIZE                      _UL_(0x00020000)    /*  128kB Memory segment type: other */
#define IRAM_SIZE                      _UL_(0x00060000)    /*  384kB Memory segment type: ram */
#define EBI_CS0_SIZE                   _UL_(0x01000000)    /* 16384kB Memory segment type: other */
#define EBI_CS1_SIZE                   _UL_(0x01000000)    /* 16384kB Memory segment type: other */
#define EBI_CS2_SIZE                   _UL_(0x01000000)    /* 16384kB Memory segment type: other */
#define EBI_CS3_SIZE                   _UL_(0x01000000)    /* 16384kB Memory segment type: other */
#define SDRAM_CS_SIZE                  _UL_(0x10000000)    /* 262144kB Memory segment type: other */

#define PERIPHERALS_ADDR               _UL_(0x40000000)    /**< PERIPHERALS base address (type: io)*/
#define SYSTEM_ADDR                    _UL_(0xe0000000)    /**< SYSTEM base address (type: io)*/
#define QSPIMEM_ADDR                   _UL_(0x80000000)    /**< QSPIMEM base address (type: other)*/
#define AXIMX_ADDR                     _UL_(0xa0000000)    /**< AXIMX base address (type: other)*/
#define ITCM_ADDR                      _UL_(0x00000000)    /**< ITCM base address (type: other)*/
#define IFLASH_ADDR                    _UL_(0x00400000)    /**< IFLASH base address (type: flash)*/
#define IROM_ADDR                      _UL_(0x00800000)    /**< IROM base address (type: rom)*/
#define DTCM_ADDR                      _UL_(0x20000000)    /**< DTCM base address (type: other)*/
#define IRAM_ADDR                      _UL_(0x20400000)    /**< IRAM base address (type: ram)*/
#define EBI_CS0_ADDR                   _UL_(0x60000000)    /**< EBI_CS0 base address (type: other)*/
#define EBI_CS1_ADDR                   _UL_(0x61000000)    /**< EBI_CS1 base address (type: other)*/
#define EBI_CS2_ADDR                   _UL_(0x62000000)    /**< EBI_CS2 base address (type: other)*/
#define EBI_CS3_ADDR                   _UL_(0x63000000)    /**< EBI_CS3 base address (type: other)*/
#define SDRAM_CS_ADDR                  _UL_(0x70000000)    /**< SDRAM_CS base address (type: other)*/

/* ************************************************************************** */
/**  DEVICE SIGNATURES FOR SAME70Q21B                                         */
/* ************************************************************************** */
#define CHIP_JTAGID                    _UL_(0X05B3D03F)
#define CHIP_CIDR                      _UL_(0XA1020E01)
#define CHIP_EXID                      _UL_(0X00000002)

/* ************************************************************************** */
/**  ELECTRICAL DEFINITIONS FOR SAME70Q21B                                    */
/* ************************************************************************** */
#define CHIP_FREQ_SLCK_RC_MIN          _UL_(20000)         
#define CHIP_FREQ_SLCK_RC              _UL_(32000)         /**< \brief Typical Slow Clock Internal RC frequency */
#define CHIP_FREQ_SLCK_RC_MAX          _UL_(44000)         
#define CHIP_FREQ_MAINCK_RC_4MHZ       _UL_(4000000)       
#define CHIP_FREQ_MAINCK_RC_8MHZ       _UL_(8000000)       
#define CHIP_FREQ_MAINCK_RC_12MHZ      _UL_(12000000)      
#define CHIP_FREQ_CPU_MAX              _UL_(300000000)     
#define CHIP_FREQ_XTAL_32K             _UL_(32768)         
#define CHIP_FREQ_XTAL_12M             _UL_(12000000)      
#define CHIP_FREQ_FWS_0                _UL_(23000000)      /**< \brief Maximum operating frequency when FWS is 0 */
#define CHIP_FREQ_FWS_1                _UL_(46000000)      /**< \brief Maximum operating frequency when FWS is 1 */
#define CHIP_FREQ_FWS_2                _UL_(69000000)      /**< \brief Maximum operating frequency when FWS is 2 */
#define CHIP_FREQ_FWS_3                _UL_(92000000)      /**< \brief Maximum operating frequency when FWS is 3 */
#define CHIP_FREQ_FWS_4                _UL_(115000000)     /**< \brief Maximum operating frequency when FWS is 4 */
#define CHIP_FREQ_FWS_5                _UL_(138000000)     /**< \brief Maximum operating frequency when FWS is 5 */
#define CHIP_FREQ_FWS_6                _UL_(150000000)     /**< \brief Maximum operating frequency when FWS is 6 */
#define CHIP_FREQ_FWS_NUMBER           _UL_(7)             /**< \brief Number of FWS ranges */



#ifdef __cplusplus
}
#endif

/** @}  end of SAME70Q21B definitions */


#endif /* _SAME70Q21B_H_ */

